Repository: sambar-fgfs/Kanboard-documentation-ja
Catalog: resource/kanboard-documentation-ja.tmx
Source language: en_us
Languages: ja

source: - Kanboard includes the default providers “WebLink” and “Attachment”
ja: - Kanboardに含まれるデフォルトのプロバイダの “WebLink” と “Attachment”

source: Read the library documentation for more information.
ja: さらなる情報はライブラリの文書を参照願います。

source: // Enable captcha after 3 authentication failure define('BRUTEFORCE_CAPTCHA', 3);
ja: // 3 回認証に失敗した場合にcaptcha認証を行う define('BRUTEFORCE_CAPTCHA', 3);

source: You can change the default column names here.
ja: ここで、デフォルトのカラム名を変更できます。

source: The task reference is an external ID of your task, for example a ticket number from another software.
ja: タスクの外部参照IDとは、例えば別のソフトウェアから付けられたチケット番号等です。

source: - `SMS Two-Factor Authentication <https://github.com/kanboard/plugin-sms-2fa>`__
ja: - `SMS 二要素認証 <https://github.com/kanboard/plugin-sms-2fa>`__

source: You can customize this address by changing the value of the constant ``MAIL_FROM`` in your config file.
ja: 設定ファイルの ``MAIL_FROM`` の値を変更することで、このアドレスを変更できます。

source: Reference:
ja: 参照:

source: After a successful login, a one-time code (6 characters) is asked to the user to allow access to Kanboard.
ja: パスワードとIDの入力に成功した後、Kanboardへユーザーのアクセスを許可するために、ワンタイムパスワード(6文字)が質問されます。

source: - Project restrictions
ja: - プロジェクトの制限

source: // LDAP DN for administrators
ja: // システム管理者のLDAP 識別名

source: Note: When you close a task, all sub-tasks not completed will be changed to the status "Done".
ja: 注意: タスクを完了するとき、すべての未完了のサブタスクの状態は **完了** に変更されます。

source: By default, user authentication can be done with multiple methods:
ja: デフォルトで複数の方法でのユーザー認証をすることができます:

source: - Do not use Sqlite over NFS, only when you have a disk with fast I/O.
ja: - 高速なディスクI/Oがある場合は、NFS超しで Sqliteを使用しないでください。

source: - Don’t forget to enable the required php extensions mentioned above
ja: - 上述した、必要なPHP拡張を有効にするのを忘れないでください。

source: - Switch to the calendar view = **v c**
ja: - カレンダービューに切り替え(要プラグイン) = **v c**

source: Note: You can configure an automatic action to define the start date automatically when you move a task to the column of your choice.
ja: 注意:自動アクションで選択していたカラムにタスクを移動したときに開始日を自動で定義するように設定することができます。

source: When all SQL statements of the migration are executed, update the schema version number 6.
ja: 全てのマイグレーションのSQL文を実行したら、スキーマのバージョン番号をアップデートする。 6.

source: // Session duration in second (0 = until the browser is closed)
ja: // セッションの有効期間 (秒指定。 0 の場合、ブラウザを閉じるまで)

source: - Only administrators and managers can create those projects
ja: - システム管理者と組織の管理者のみがこれらのプロジェクトを作成できます。

source: - ``DatabaseUserProvider`` provides information for an internal user
ja: - ``DatabaseUserProvider`` 内部のユーザーの情報を提供します。

source: You can still use the original template using the “kanboard:” prefix:
ja: それでも、“kanboard:” 接頭辞を使うことで元のテンプレートを使用できます:

source: The exported data will be printed on the standard output:
ja: エクスポートされたデータは標準出力に表示されるでしょう:

source: Modification:
ja: 変更:

source: Search by color ~~~~~~~~~~~~~~~
ja: 色で検索 ~~~~~~~~~~~~~~~

source: Now, if you use a class that extends from ``Core\Base``, you can access directly to those class instance:
ja: すでに、 ``Core\Base`` から拡張したクラスで、これらのインスタンスに直接アクセスできます。

source: Inline code ~~~~~~~~~~~
ja: インラインコード ~~~~~~~~~~~

source: - Search tasks due yesterday: ``due:yesterday``
ja: - 昨日が期限のタスクを選択: ``due:yesterday``

source: - **task_id** (integer, required)
ja: - **task_id** (integer, 必須)

source: Or from the task sidebar menu in the task detail view:
ja: もしくは、タスク概要画面のサイドバーメニューから完了できます:

source: note:: Port is being hosted on `bitbucket <https://bitbucket.org/if0/freebsd-kanboard/>`__.
ja: 注意:: `bitbucket <https://bitbucket.org/if0/freebsd-kanboard/>`__ でportsがホストされています。

source: Don’t forget to change your password!
ja: パスワードの変更を忘れないようにしてください。

source: - The bug tracker should be reserved only for bug reports.
ja: - バグトラッカーはバグ報告専用に確保しています。

source: Plugin Methods --------------
ja: プラグインのメソッド --------------

source: figure:: /_static/average-time-spent-into-each-column.png :alt: Average time spent into each column
ja: figure:: /_static/average-time-spent-into-each-column.png :alt: 各カラムでの平均経過時間

source: figure:: /_static/menu-close-task.png :alt: Close a task from drop-down menu
ja: figure:: /_static/menu-close-task.png :alt: タスクのドロップダウンメニューからタスクを完了

source: Adding a new event ------------------
ja: 新しいイベントを追加する ------------------

source: // Credentials for authentication on the SMTP server (not mandatory)
ja: // SMTPサーバーの認証の設定(必須ではない)

source: // php: session information is stored by the internal PHP session handlers
ja: // php: セッション情報はPHP内部のセッションハンドラに保存される

source: For the filter class implementation, there are several examples in the source code under the namespace ``Kanboard\Filter``.
ja: いくつかのフィルタークラスの実装の例は、 ``Kanboard\Filter`` 名前空間の下のソースコードにあります。

source: When the board cannot fit on your screen, a horizontal scroll bar will appear at the bottom.
ja: ボードが画面に収まりきらない時は、水平スクロールバーが画面下に表示されます。

source: The Calendar feed export follows the iCal standard.
ja: カレンダー配信のエクスポートの流れはiCalendarの標準によります。(訳注:多分RFC5545。)

source: In your plugin registration file call the method ``setType()``:
ja: プラグインとして登録したファイルの中で ``setType()`` メソッドを呼び出す:

source: - Right click on the icon and start Apache
ja: - アイコンを右クリックして、Apacheを開始する

source: Search by description ~~~~~~~~~~~~~~~~~~~~~
ja: 概要で検索 ~~~~~~~~~~~~~~~~~~~~~

source: // Mysql SSL key
ja: // Mysql のSSL キー

source: - **subtask_id** (integer, required)
ja: - **subtask_id** (integer, 必須)

source: - ``getName()``: Get user full name
ja: - ``getName()``: ユーザーのフルネームを取得する

source: If you use Nginx, define this value:
ja: Nginxを使用している場合、以下の値を定義する:

source: - To restore an old backup, just replace and overwrite the actual file ``data/db.sqlite``.
ja: - 古いバックアップから復元するには、単に ``data/db.sqlite`` を正しいファイルに置き換える/上書きするだけです。

source: - Result on success: **List of comments**
ja: - 成功時の返り値: **コメントのリスト**

source: - Heroku account, you can use a free account
ja: - 無料アカウントで良いので、Heroku アカウント

source: - Action linked to the event
ja: - イベントとリンクされたアクション

source: Task File API Procedures ========================
ja: タスクのファイルのAPIプロシージャ ===========================

source: // Enable LDAP group provider for project permissions
ja: // LDAP グループプロバイダをプロジェクトの権限設定に使用する

source: - Tasks with a shadow are recently modified.
ja: - 最近更新されたタスクには影が付きます。.

source: Calendar Settings -----------------
ja: カレンダー設定 -----------------

source: - Official website: https://kanboard.org
ja: - 公式Webサイト: https://kanboard.org

source: For each HTTP request:
ja: HTTPのリクエストの都度:

source: define('LOG_DRIVER', 'file'); // Other drivers are: syslog, stdout, stderr, system or file
ja: define('LOG_DRIVER', 'file'); // ドライバは、 syslog, stdout, stderr, system ,file です。

source: - Find tasks with a specific category: ``category:"Feature Request"``
ja: - カテゴリで検索: ``category:"Feature Request"``

source: Always use the english version in the source code.
ja: ソースコード中では、常に英語版が使用されます。

source: To have a pluggable system, authentication drivers must implement a set of interfaces:
ja: プラガブルなシステムを持っているので、認証ドライバーにインターフェースを与えなければなりません:

source: // Session duration in second (0 = until the browser is closed) // See http://php.net/manual/en/session.configuration.php#ini.session.cookie-lifetime define('SESSION_DURATION', 0);
ja: // セッションの有効期間 (秒指定。 0 の場合、ブラウザを閉じるまで) // http://php.net/manual/ja/session.configuration.php#ini.session.cookie-lifetime も参照のこと define('SESSION_DURATION', 0);

source: Just change the value of ``LDAP_ACCOUNT_CREATION`` to ``false``:
ja: ``LDAP_ACCOUNT_CREATION`` の値を ``false`` にするだけです:

source: - **owner_id** (integer, optional)
ja: - **owner_id** (integer, 任意)

source: // We choose to use MySQL instead of Sqlite define('DB_DRIVER', 'mysql');
ja: // Sqliteの代わりにMySQLを使用するよう選択する define('DB_DRIVER', 'mysql');

source: How can I help?
ja: 何か手伝える事がありますか?

source: - Kanboard uses the task transitions to calculate the data.
ja: - Kanboardはこのデータを計算するためにタスクの推移を利用します。

source: Web notifications -----------------
ja: Web 通知 -----------------

source: - Run ``sphinx-quickstart``
ja: - ``sphinx-quickstart`` を実行する

source: However, Kanboard can register any class in the container easily.
ja: しかしながら、Kanboard はコンテナ内のクラスの登録を簡単に行えます。

source: It’s not possible to reply to this address.
ja: これはこのアドレスに返信できません。

source: - MM/DD/YYYY (default)
ja: - MM/DD/YYYY (デフォルト)

source: Installation, deployment and administration guides.
ja: インストール、デプロイと管理のためのガイドです

source: Kanboard supports multiple roles at the application level and at the project level.
ja: Kanboard はプロジェクトのレベルとアプリケーションのレベルによって複数の役割をサポートしています。

source: - **link_id** (integer, required)
ja: - **link_id** (integer, 必須)

source: Run `make clean html` and open the file `build/html/index.html` in your browser.
ja: `make clean html` を実行し、`build/html/index.html` をブラウザで開く。

source: Before to copy the tasks, Kanboard will ask you the destination properties that are not common between the source and destination project.
ja: タスクをコピーする前に、Kanboardはコピー元とコピー先のプロジェクトの間で共通ではないプロパティを問い合わせます。

source: - **filename** (integer, required)
ja: - **filename** (integer, 必須)

source: It’s not mandatory to return a value for each method.
ja: 個々のメソッドは必ずしも値を返すわけではありません。

source: - Additional parameters
ja: - 追加のパラメータ

source: Client side -----------
ja: クライアント側 -----------

source: Duplicate a task into the same project ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: 同じプロジェクトにタスクを複製する ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: figure:: /_static/closing-tasks.png :alt: Close task
ja: figure:: /_static/closing-tasks.png :alt: タスクを完了する

source: - ``LDAP_GROUP_ATTRIBUTE_NAME``: LDAP attribute used to fetch the group name
ja: - ``LDAP_GROUP_ATTRIBUTE_NAME``: グループ名を取得するために使用するLDAP 属性

source: - `Official Kanboard images <https://hub.docker.com/r/kanboard/kanboard/>`__
ja: - `Kanboard 公式のイメージ <https://hub.docker.com/r/kanboard/kanboard/>`__

source: - Private projects can be created by anyone.
ja: - プライベートプロジェクトは誰でも作成できます。

source: Kanboard supports iCal feeds for projects and users.
ja: KanboardはプロジェクトとユーザーについてのiCalender配信をサポートしています。

source: The end-user will use an auto-complete box and search for a group.
ja: エンドユーザーはグループの検索ボックスでオートコンプリートを使えるようになるでしょう。

source: - Purpose: **Create a new user authentified by LDAP**
ja: - 用途: **LDAP認証を行うユーザーの新規作成**

source: - **prepend_unassigned** (boolean, optional, default is false)
ja: - **prepend_unassigned** (boolean, 任意。 デフォルトでは false)

source: From the dropdown menu in the top right corner, go to the menu **Users Management** 2.
ja: 右上部角のドロップダウンメニューから **ユーザー管理** を開いてください。 2.

source: This class abstract the information gathered from another system.
ja: この抽象化されたクラスは別のシステムから情報を集めます。

source: - Be sure that your server or your hosting provider allows you to send emails
ja: - サーバーかホスティングサービスがメール送信を許可しているか確認する

source: - Result on success: **user session data**
ja: - 成功時の返り値: **ユーザーセッションのデータ**

source: - Purpose: **Remove a project**
ja: - 用途: **プロジェクトを削除する**

source: - Access to the API with the user “jsonrpc” and the token available on the settings page
ja: - 設定ページから利用可能なトークンとユーザーの "jsonrpc" でAPIにアクセスする

source: - Kanboard roles are mapped to Active Directory groups
ja: - Kanboardの役割をマップするActive Directory グループ

source: warning:: This feature is experimental.
ja: 警告:: この機能は試験的なものです。

source: Allow only one subtask in progress at the same time for a user ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: 一人のユーザーが一度に一つのサブタスクのみを進行させるようにする ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: - An external URL can be called automatically when an event occurs in Kanboard (task creation, comment updated, etc)
ja: - Kanboardでイベント(タスクの作成、コメントの更新等)が発生した時、外部URLが自動的に呼び出されます。

source: Example with Python -------------------
ja: Pythonを使用する例 -------------------

source: Available methods from ``Kanboard\Core\Plugin\Base``:
ja: ``Kanboard\Core\Plugin\Base`` から利用可能なメソッド:

source: The PHPUnit config file is ``tests/units.sqlite.xml``.
ja: PHPUnit の設定ファイルは ``tests/units.sqlite.xml`` です。

source: Integration tests are mainly used to test the API.
ja: 結合テストは主にAPIのテストに使用されます

source: - The URL looks like ``/?controller=auth&amp;action=login&amp;redirect_query=`` instead of ``?controller=auth&action=login&redirect_query=``
ja: - ``?controller=auth&action=login&redirect_query=`` の代わりに、 ``/?controller=auth&amp;action=login&amp;redirect_query=`` のURLが表示される

source: When your handler is registered, the end-user can choose to receive the new notification type or not.
ja: ハンドラが登録された時、エンドユーザーは新しいタイプでの通知を受け取るか否か選択できます。

source: - **recurrence_trigger** (integer, optional)
ja: - **recurrence_trigger** (integer, 任意)

source: - Use an email provider that use an HTTP API to send emails (Sendgrid, Mailgun or Postmark)
ja: - Emailの送信にHTTP APIを使用してEmailプロバイダを利用する (Sendgrid, Mailgun or Postmark)

source: Subtask Time Tracking ---------------------
ja: サブタイムの時間追跡 ---------------------

source: - Find tasks with no reference: ``reference:none``
ja: - 外部参照IDが無い場合: ``reference:none``

source: // LDAP attribute for the group name define('LDAP_GROUP_ATTRIBUTE_NAME', 'cn');
ja: // LDAP 属性のグループ名 define('LDAP_GROUP_ATTRIBUTE_NAME', 'cn');

source: - Purpose: **Get all available projects**
ja: - 用途: **全ての活動中のプロジェクトを取得する**

source: Each item has a type, a URL, a dependency type and a title.
ja: 個々のアイテムはURL、依存タイプ、そしてタイトルの型を持ちます。

source: - Tasks
ja: - タスク

source: Asset hooks can be used to add a new stylesheet easily or a new JavaScript file in the layout.
ja: アセットのフックは簡単に新しいスタイルシートを追加したり、レイアウトに新しくJavaScriptファイルを追加するのに利用されます。

source: To add a new event, you have to call the method ``register()`` of the class ``Kanboard\Core\Event\EventManager``:
ja: 新しいイベントを追加するには、 ``Kanboard\Core\Event\EventManager`` クラス内の ``register()`` メソッドを呼び出さなければなりません:

source: Using the SMTP method with an external server can be very slow.
ja: SMTPで外部サーバーを使用した場合、非常に遅くなる場合があります。

source: - Date of the action
ja: - アクションを起こした日時

source: - Meeting
ja: - 面会

source: Improve Sqlite performances ---------------------------
ja: Sqlite のパフォーマンス向上 ---------------------------

source: - Translations are stored inside the directory ``app/Locale``
ja: - 翻訳ファイルは ``app/Locale`` ディレクトリの下にあります。

source: - Each project has its own calendar.
ja: - 各々のプロジェクトは自身のカレンダーを持ちます

source: The default login and password is **admin/admin** 6.
ja: デフォルトのログイン名とパスワードは **admin/admin** です。 6.

source: Attribute: **swimlane**
ja: 属性: **swimlane**

source: -V, --version Display this application version
ja: -V, --version アプリケーションのバージョンを表示する

source: Configuration by calling a URL ------------------------------
ja: URLを呼び出す設定 ------------------------------

source: The directory layout and the file names must be the same as the english version.
ja: ディレクトリの構造とファイル名は英語版に合わせる必要があります。

source: To define tags globally for all projects, go to the application settings:
ja: 全てのプロジェクトに共通するタグは、アプリケーション設定から定義してください:

source: Tasks =====
ja: タスク =====

source: You don’t necessarily need to support both.
ja: 両方をサポートすることは必須ではありません。

source: // LDAP attribute for user avatar image: thumbnailPhoto or jpegPhoto
ja: // LDAP 属性のユーザーのアバター画像 : サムネイル写真 or Jpeg画像

source: Your Kanboard calendar can also be available from your Android device if you enable the synchronization.
ja: また、同期を有効にしているならばKanboardカレンダーはAndroidデバイスからも利用可能です。

source: Kanboard uses Pimple, a simple PHP Dependency Injection Container.
ja: Kanboard は、シンプルなPHPのDIの pimpleを使用します。

source: figure:: /_static/apple-calendar-add-subscription.png :alt: Add iCal subscription
ja: figure:: /_static/apple-calendar-add-subscription.png :alt: iCalサブスクリプションを追加

source: figure:: /_static/example-restriction-task-drag-and-drop.png :alt: Example restriction task drag and drop
ja: figure:: /_static/example-restriction-task-drag-and-drop.png :alt: タスクのドラッグアンドドロップの制限の例

source: - If there is more than one swimlane, the board will show all swimlanes.
ja: - 複数のスイムレーンがある場合、ボードはすべてのスイムレーンを表示します。

source: - Purpose: **Remove task metadata by name**
ja: - 用途: **名前でタスクのメタデータを削除する**

source: - To be validated
ja: - 検証中

source: Registration ------------
ja: 登録 ------------

source: figure:: /_static/recurring-tasks.png :alt: Recurring task
ja: figure:: /_static/recurring-tasks.png :alt: 反復タスク

source: |Deploy|
ja: |デプロイ|

source: +-----------------------------------+ | Browser | +===================================+ | Safari | +-----------------------------------+ | Google Chrome | +-----------------------------------+ | Mozilla Firefox | +-----------------------------------+ | Microsoft Internet Explorer >= 11 | +-----------------------------------+ | Microsoft Edge | +-----------------------------------+
ja: +-----------------------------------+ | Browser | +===================================+ | Safari | +-----------------------------------+ | Google Chrome | +-----------------------------------+ | Mozilla Firefox | +-----------------------------------+ | Microsoft Internet Explorer 11以降 | +-----------------------------------+ | Microsoft Edge | +-----------------------------------+

source: figure:: /_static/project-enable-sharing.png :alt: Enable public access
ja: figure:: /_static/project-enable-sharing.png :alt: 公開アクセスの有効化

source: Enable Apache in your ``/etc/rc.conf``:
ja: Apache を ``/etc/rc.conf`` で有効にする:

source: - Move the task to another column when the category is changed
ja: - カテゴリが変更されたときにタスクを別のカラムに移動

source: Execute database migrations ~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: データベースのマイグレーションを実行する ~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: figure:: /_static/board-settings.png :alt: Board settings
ja: figure:: /_static/board-settings.png :alt: 基本設定

source: The restoration must be done manually when no body use the software.
ja: 復元は何もソフトウェアを使わずに、必ず手動で行う必要があります。

source: Classes that implements this interface abstract the group information, there are only 3 methods:
ja: このグループ情報を要約するインターフェースに実装されているクラスには、たった3つのメソッドしかありません:

source: - Keeping issues open indefinitely will not get fixed by itself.
ja: - issueをオープンで維持しても、それは勝手に修正されません。

source: - The number of features is voluntarily limited.
ja: - 特徴面で自発的に参加してる人の数は限られています。

source: - Reported
ja: - 報告

source: - There is no code review or any approval process to submit a plugin.
ja: - これはコードレビュー、あるいはいかなる承認プロセスも無くプラグインを適用します。

source: Example of HTTP request ~~~~~~~~~~~~~~~~~~~~~~~
ja: HTTP リクエストの例 ~~~~~~~~~~~~~~~~~~~~~~~

source: Since the task lexer is a factory that returns a new instance each time, you have to extend the ``taskLexer`` container with the method ``extend()`` of Pimple.
ja: タスクの字句解析器が新しいインスタンスを都度返すので、 ``extend()`` メソッドか、pimpleによって ``taskLexer`` コンテナを拡張しなければなりません。

source: - Purchase
ja: - 契約

source: Windows Server and Apache -------------------------
ja: Windows Server と Apache -------------------------

source: - **Assignee**: The person that will work on the task.
ja: - **担当者**: タスクを受け持つ人を指定します。

source: - Result on failure: **empty array**
ja: - 失敗時の返り値: **空の配列**

source: - **reference** (string, optional)
ja: - **reference** (string, 任意)

source: Describe your environment:
ja: 環境を詳しく書いてください:

source: You must have Mysql or MariaDb installed on localhost.
ja: ローカルホスト上にMySQLかMariaDBがインストールされている必要があります。

source: locale
ja: ロケール

source: With your browser go to http://yourpersonalserver/kanboard 5.
ja: ブラウザで http://yourpersonalserver/kanboard を開いてください。 5.

source: - The default swimlane is always on the top but you can hide it.
ja: - 既定スイムレーンは常に最上部に表示されますが、隠すこともできます。

source: Contributor Guidelines ======================
ja: 貢献のガイドライン ======================

source: - If the task is assigned to someone, the initials of the person are shown next to the task number.
ja: - タスクが誰かに割当てられている場合、タスク番号の隣に担当者のイニシャルが表示されます。

source: Test 8.
ja: 動作試験 8.

source: - Be a member of the project that will trigger notifications
ja: - 通知を受け取るプロジェクトのメンバーになる

source: figure:: /_static/list-view.png :alt: List view
ja: figure:: /_static/list-view.png :alt: リストビュー

source: Software development ~~~~~~~~~~~~~~~~~~~~
ja: ソフトウェア開発 ~~~~~~~~~~~~~~~~~~~~

source: The date formats are the same as the due date.
ja: 日付の指定方法は期限の時と同じです。

source: Online Shops ~~~~~~~~~~~~
ja: オンラインショップ ~~~~~~~~~~~~

source: - Send overdue task notifications
ja: - 期限切れタスクの通知の送信

source: - Everyday, the sum of the story points for each column is calculated.
ja: - 各カラム毎のストーリーポイントの合計が毎日算出されます。

source: List of supported events ~~~~~~~~~~~~~~~~~~~~~~~~
ja: サポートされるイベントのリスト ~~~~~~~~~~~~~~~~~~~~~~~~

source: // Mysql/Postgres username define('DB_USERNAME', 'root');
ja: // Mysql/Postgres でのユーザー名 define('DB_USERNAME', 'root');

source: - Each function is a migration ``version_1()``, ``version_2()``, etc.
ja: - ``version_1()``, ``version_2()``, 等の個々の関数でマイグレーションをします。

source: Load the PHP module for Apache:
ja: PHP モジュールを Apache にロードする:

source: The profile image is **downloaded at login time only if the user do not already have uploaded an image previously**.
ja: プロフィール画像は **ユーザーが今まで画像をアップロードしていない場合、ログイン時にダウンロードされるだけです**。

source: There are 3 different environment available to run tests against each supported database.
ja: それは3つの異なる環境であっても、個々のデータベース毎にテストをする為です。

source: Decompress the new archive 2.
ja: 新しいアーカイブを展開する 2.

source: To hide a column, click on the column dropdown menu and choose "Hide this column":
ja: カラムを非表示にするには、カラム上のドロップダウンメニューをクリックし、"このカラムを隠す"を選択してください。

source: locale:compare Compare application translations with the fr_FR locale
ja: locale:compare アプリケーションの翻訳を fr_FR のロケールと比較する

source: Brute-force protection ----------------------
ja: 総当たり攻撃からの保護 ----------------------

source: Why are you not developing my feature request?
ja: 私が要望した機能のリクエストの開発をしてないのはなぜですか？

source: Switching between horizontal scrolling and compact view can be done with the keyboard shortcut **"c"** or by using the drop-down menu on the top left.
ja: 横スクロールとコンパクトビューの相互切り替えはショートカットキーの **"c"** か、上部左のドロップダウンメニューから行えます。

source: - Define action parameter: **Column = Done** (this is the destination column)
ja: - アクションのパラメータ: **カラム = Done** (送り先となるカラム) を定義

source: From a Unix shell run this command:
ja: Unix のシェルで以下のコマンドを実行してください:

source: Subtasks are useful to split the work of a task.
ja: 一つのタスクを分割するのにサブタスクが有用です。

source: Two-Factor Authentication -------------------------
ja: 二要素認証 -------------------------

source: :alt: Task time tracking
ja: :alt: タスクの時間追跡

source: The notification is sent according to the user settings, it can be an email, a web notification or even a message on Slack/Hipchat/Jabber if you have installed the right plugins.
ja: 通知は、Email, Web通知、もしくはプラグインが正しくインストールされていれば、Slack/Hipchat/Jabberのメッセージからユーザーが設定した方法により送られます。

source: - Define action parameters: **Color = Blue** and **Category = Feature Request**
ja: - アクションを定義: **色 = ブルー** と、 **カテゴリ = Feature Request**

source: - This chart shows the number of tasks cumulatively for each column over the time.
ja: - このチャートは、各カラムごとのタスク数の推移を時系列に沿って表します。

source: Run daily project stats calculation ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: 毎日の統計を計算する ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: `More examples of LDAP filters for Active Directory <http://social.technet.microsoft.com/wiki/contents/articles/5392.active-directory-ldap-syntax-filters.aspx>`__
ja: ` 更なるActive Directory のLDAPフィルターの例 <http://social.technet.microsoft.com/wiki/contents/articles/5392.active-directory-ldap-syntax-filters.aspx>`__

source: Example of notification plugins -------------------------------
ja: 通知プラグインの例 -------------------------------

source: - Purpose: **Update a link**
ja: - Purpose: **リンクをアップデートする**

source: - Result on success: **List of users**
ja: - 成功時の返り値: **ユーザーのリスト**

source: Unordered list can use asterisks, minuses or pluses.
ja: 箇条書きは、アスタリスク、マイナス、プラスが使用可能です。

source: You can customize the default settings of Kanboard by adding a file ``config.php`` at the project root or in the ``data`` folder.
ja: ``config.php`` をプロジェクトのルートディレクトリか、``data`` フォルダに追加することで、Kanboardのデフォルト設定をカスタマイズできます。
